***messages***

:STRINGS

IDS_UNINSTTITLE                "WinRAR 压缩文件管理器"
IDS_WINRARHELP                 "WinRAR 中文帮助"
IDS_RARHELP                    "控制台 RAR 中文手册"
IDS_WHATSNEW                   "最新版本里有哪些新功能"

; Name of WhatsNew.txt file in distribution package.
; Edit it only if you renamed this file.
IDS_WHATSNEWNAME               "WhatsNew.txt"

IDS_UNINSTALLRAR               "卸载 WinRAR"
IDS_UNINSTALLCOMPLETED         "已完全卸载"
IDS_UNINSTALLSHOULDDELETE      "您应该手动删除 %s"
IDS_SETTINGSWARN               "除非提前导出，否则将丢失所有设置，包括存储在管理器中的密码和压缩配置文件。"
IDS_CONTINUEUNINSTALL          "继续卸载 WinRAR 吗?"
IDS_CANNOTOPENLIST             "无法打开列表文件 %s"
IDS_WINRARARC                  "WinRAR 压缩文件"
IDS_WINRARZIPARC               "WinRAR ZIP 压缩文件"
IDS_RARRECVOL                  "RAR 恢复卷"
IDS_HOMEURL                    "https://www.win-rar.com"
IDS_WINRARDESC                 "处理 RAR, ZIP 和其它压缩文档格式"
IDS_REBOOTREQUIRED             "您需要重新启动 Windows 来完全卸载 WinRAR。"
IDS_INSTHELP1                  "这些选项控制 WinRAR 集成到 Windows 中。"
IDS_INSTHELP2                  "第一组选项允许您选择由 WinRAR 处理的压缩文件类型。"
IDS_INSTHELP3                  "第二组让您选择 WinRAR 可执行文件链接的位置。"
IDS_INSTHELP4                  "最后一组选项可以调节 WinRAR 集成到 Windows 外壳中的属性。"
IDS_INSTHELP5                  "外壳集成提供方便的功能,像文件右键菜单的“解压”项目,所以通常没有禁止它的必要。"
IDS_INSTHELP6                  "点击“帮助”按钮可以阅读关于这些选项的更多详细描述。"
IDS_WARN32BIT                  "您已在 64 位 Windows 上安装了 32 位的 WinRAR。为了获得更好的性能和外壳集成，建议卸载 32 位的 WinRAR 版本，并安装 64 位的 WinRAR。"
IDS_INSTREBOOTREQUIRED         "您需要重启您的计算机来完成安装。"
IDS_BETA                       "beta"
IDS_32BIT                      "32-位"
IDS_64BIT                      "64-位"
IDS_SINGLETOPITEM              "如果关闭级联关联菜单，则只能显示单个菜单项。可以使用“关联菜单项...”自定义此项。"
IDS_INSTINFOFOLDER             "已将 WinRAR 成功安装到这个文件夹。"

; Displayed beginning from Windows 11.
IDS_INSTINFOASSOCIATE          "您可能需要在 Windows 中打开一个压缩文件，并在出现的提示中选择“总是”来为 WinRAR 完成与该压缩文件格式的关联。"

IDS_INSTINFOSETTINGS           "使用 WinRAR“选项”菜单中的“设置...”命令可以进行更多定制。"
IDS_INSTINFOPURCHASE           "请注意 WinRAR 不是免费软件。只有您购买了许可证，我们才能为您继续改善这款软件。"
IDS_INSTINFODOWNLOAD           "请访问 WinRAR 网站来下载最新的 WinRAR 版本。您还可以在这里通过我们安全的交易服务器，购买您的 WinRAR 许可证。"


:DIALOG SETUPDLG

SIZE                           "100*100"
CAPTION                        "WinRAR 简体中文版安装"
IDC_ASSOCWITH                  "WinRAR 关联文件"
IDC_ASSOCRAR                   "&RAR"
IDC_ASSOCZIP                   "&ZIP"
IDC_ASSOC7Z                    "7Z"
IDC_ASSOCARJ                   "ARJ"
IDC_ASSOCBZ2                   "BZ2"
IDC_ASSOCCAB                   "CAB"
IDC_ASSOCGZ                    "GZ"
IDC_ASSOCISO                   "ISO"
IDC_ASSOCJAR                   "JAR"
IDC_ASSOCLZ                    "LZ"
IDC_ASSOCLZH                   "LZH"
IDC_ASSOCTAR                   "TAR"
IDC_ASSOCUUE                   "UUE"
IDC_ASSOCXZ                    "XZ"
IDC_ASSOCZ                     "Z"
IDC_ASSOCZIPX                  "ZIPX"
IDC_ASSOCZST                   "ZST"
IDC_ASSOC001                   "001"
IDC_ASSOCALL                   "全部切换(&A)"
IDC_INTEGRATIONINTERFACE       "界面"
IDC_LINKDESKTOP                "添加 WinRAR 到桌面(&D)"
IDC_LINKSTARTMENU              "添加 WinRAR 到开始菜单(&S)"
IDC_LINKPROGRAMS               "创建 WinRAR 程序组(&P)"
IDC_SHELLINTEGRATION           "外壳集成"
IDC_SHELLEXT                   "集成 WinRAR 到外壳(&I)"
IDC_SHELLCASCADED              "层叠的关联菜单(&T)"
IDC_SHELLICONS                 "关联菜单里的图标(&N)"
IDC_SHELLLEGACYMENU            "遗留关联菜单(&L)"
IDC_SETCONTEXTMENU             "关联菜单项目(&C)..."
IDOK                           "确定"
IDHELP                         "帮助"


:DIALOG DONEDLG

SIZE                           "100*100"
CAPTION                        "WinRAR 简体中文版安装"
IDOK                           "完成"
IDC_WHATSNEW                   "新功能(&W)"
IDC_RUNWINRAR                  "运行 WinRAR(&R)"
IDC_VIEWHELP                   "阅读帮助(&H)"
IDC_VIEWLICENSE                "查看许可证(&L)"
IDC_VIEWPRICE                  "订购(&O)"
IDC_HOMEPAGE                   "主页(&M)"
IDC_THANKS                     "感谢您使用 WinRAR！"


:DIALOG SETUPCONTEXTITEMS

SIZE                           "100*100"
CAPTION                        "关联菜单项目"
IDC_CONTEXTMENUITEMS           "选择要显示在资源管理器右键关联菜单中的项目"
IDC_CONTEXTEXTRACTTO           "解压文件(&A)..."
IDC_CONTEXTEXTRACTHERE         "解压到当前文件夹(&X)"
IDC_CONTEXTEXTRACT             "解压到<文件夹\\>(&E)"
IDC_CONTEXTEXTRACTSEPARATE     "解压每个压缩文件到单独的文件夹(&S)"
IDC_CONTEXTOPENSFX             "使用 WinRAR 打开(用于自解压文件)"
IDC_CONTEXTOPENARC             "使用 WinRAR 打开（用于常规压缩文件）"
IDC_CONTEXTADD                 "添加到压缩文件(&A)..."
IDC_CONTEXTADDARC              "添加到 <压缩文件名称>(&T)"
IDC_CONTEXTEMAILARC            "压缩到 <压缩文件名称> 并通过邮件发送"
IDC_CONTEXTEMAILARCOPT         "压缩并通过邮件发送..."
IDC_CONTEXTTEST                "测试压缩文件(&R)"
IDC_CONTEXTCONVERT             "转换压缩文件(&V)..."

; Positions of IDC_CONTEXTTOP* controls are overlapping with IDC_CONTEXT*.
; WinRAR hides either one or another group depending on other options.
IDC_CONTEXTTOPEXTRACT          "解压到<文件夹\\>(&E)"
IDC_CONTEXTTOPEXTRACTTO        "解压文件(&A)..."
IDC_CONTEXTTOPEXTRACTHERE      "解压到当前文件夹(&X)"
IDC_CONTEXTTOPEXTRACTSEPARATE  "解压每个压缩文件到单独的文件夹(&S)"
IDC_CONTEXTTOPADDARC           "添加到 <压缩文件名称>(&T)"
IDC_CONTEXTTOPADD              "添加到压缩文件(&A)..."

IDC_CONTEXTNEWMENU             "“新建”子菜单项目"
IDC_CONTEXTNEWRAR              "WinRAR 压缩文件"
IDC_CONTEXTNEWZIP              "WinRAR ZIP 压缩文件"
IDC_CONTEXTDROPMENU            "拖放关联菜单"
IDC_CONTEXTDRAGADD             "显示压缩文件项目(&H)"
IDC_CONTEXTDRAGEXTRACT         "显示解压项目(&C)"
IDC_CONTEXTSFXARCHIVES         "在哪里检测自解压压缩文件"
IDC_CONTEXTSFXLOCAL            "本地磁盘(&L)"
IDC_CONTEXTSFXNETWORK          "网络磁盘(&N)"
IDC_CONTEXTSFXOTHER            "其它磁盘(&O)"
IDC_CONTEXTSFXCLOUD            "云文件(&U)"
IDC_CONTEXTALWAYSARCTITLE      "总是显示压缩内容项目(&W)"
IDOK                           "确定"
IDCANCEL                       "取消"
IDHELP                         "帮助"
